import React, { Component } from 'react'
import './protocol.scss'
import { _setTitle } from '../../helper/helper'

export default class PrivateProtocol extends Component {
    componentDidMount() {
        _setTitle("贝贝贷款平台隐私政策")
    }

    render() {
        return (
            <div className="protocol">
                贝贝贷款平台隐私政策<br />
                <br />
                政策版本：2018年7月版<br />
                <br />
                贝贝贷款平台非常尊重您的个人信息的保护，因此贝贝贷款平台将按照本隐私政策的规定收集、使用、共享、存储及保护您的个人信息。<br />
                本《隐私政策》是《贝贝贷款平台用户服务协议》不可分割的组成部分，构成一个统一的整体，您接受其中任一协议则代表接受本政策。在使用贝贝贷款平台各项服务前，请您务必仔细阅读并透彻理解本政策。<br />
                如对本政策或贝贝贷款平台其他协议及政策内容有任何疑问，您可通过本政策末尾（第11条）公布的联系方式向贝贝贷款平台咨询或寻求帮助。如果您不同意本政策或贝贝贷款平台其他协议及政策的内容的，用户应暂停使用贝贝贷款平台服务，获得帮助或解答满意后方可继续使用。<br />
                <br />
                第1条适用范围<br />
                1.1为用户提供更专业、更优质、更个性化的服务是贝贝贷款平台坚持不懈的追求，也希望通过贝贝贷款平台提供的服务可以更方便用户的生活。本政策适用于贝贝贷款平台提供的所有服务，用户访问贝贝贷款平台（包括但不限于贝贝贷款平台PC端、移动端、自媒体平台、入驻的第三方平台）提供的服务，均适用本政策。<br />
                1.2需要特别说明的是，本政策不适用于其他第三方向用户提供的服务，例如贝贝贷款平台上的第三方贷款平台提供的服务等。用户向其他第三方提供的个人信息，应当遵守该第三方的隐私政策。<br />
                <br />
                第2条用户个人信息的收集<br />
                2.1贝贝贷款平台收集用户个人信息是为了向用户提供更专业、更优质、更个性化的服务，贝贝贷款平台收集信息的渠道如下：<br />
                （1）用户向贝贝贷款平台提供的信息。当用户注册贝贝贷款平台账户及用户在使用贝贝贷款平台提供的相关服务时填写及/或提交的信息，包括用户的姓名、电话号码、性别、出生年月日、居住地址、车辆信息、银行卡信息、财产信息、基本收入、婚姻状态、单位信息、借款用途、评价留言、支付信息、订单信息、您的地理位置信息。<br />
                （2）在用户使用服务过程中收集的信息。为了提供并优化用户需要的服务，贝贝贷款平台会收集用户使用服务的相关信息，这类信息包括：<br />
                i.在用户使用贝贝贷款平台服务时，用户在借款过程中为验证用户身份、评估信用能力等自行提供或输入的信息。<br />
                ii.在用户使用贝贝贷款平台服务，或访问贝贝贷款平台网页时，贝贝贷款平台自动接收并记录的用户的浏览器和计算机上的信息，包括但不限于用户的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及用户需求的网页记录等数据；如用户下载或使用贝贝贷款平台或其关联公司客户端软件，或访问移动网页使用贝贝贷款平台服务时，贝贝贷款平台可能会读取与用户位置和移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。<br />
                iii.除上述信息外，贝贝贷款平台还可能为了提供服务及改进服务质量的合理需要而收集用户的其他信息，包括用户与贝贝贷款平台的客户服务团队联系时用户提供的相关信息，用户参与问卷调查时向贝贝贷款平台发送的问卷答复信息，以及用户与贝贝贷款平台的关联方、贝贝贷款平台合作伙伴之间互动时贝贝贷款平台收集的相关信息。与此同时，为提高用户使用贝贝贷款平台提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，贝贝贷款平台可能会通过了解一些用户的网络使用习惯、用户常用的软件信息等手段来判断用户账户的风险，并可能会记录一些贝贝贷款平台认为有风险的URL。<br />
                （3）来自第三方的信息。为了给用户提供更专业、更优质、更加个性化的服务，或为提高用户贷款效率，或共同为用户提供服务，或为了预防互联网欺诈的目的，贝贝贷款平台的关联方、合作伙伴会依据法律的规定或与用户的约定或征得用户同意的前提下，向贝贝贷款平台分享用户的个人信息。<br />
                2.2用户有义务在注册时提供自己的真实资料，并保证诸如手机号码、银行卡信息等内容的真实性、有效性、安全性、完整性和及时更新，以便贝贝贷款平台为用户提供服务，并与用户进行及时、有效的联系。您理解并同意，因您提供的信息不真实、不完整或已失效，我们将无法为您提供相应的服务。<br />
                2.3用户了解并同意，以下信息不适用本政策：<br />
                （1）用户在使用贝贝贷款平台提供的搜索服务时输入的关键字信息；<br />
                （2）信用评价、违反法律规定或违反贝贝贷款平台规则行为及贝贝贷款平台已对用户采取的措施；<br />
                （3）应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。<br />
                <br />
                第3条用户个人信息的使用<br />
                3.1因收集用户的信息是为了向用户提供服务及提升服务质量的目的，为了实现这一目的，贝贝贷款平台会把用户的信息用于下列用途：<br />
                （1）为用户提供服务和义务便利所涉及的日常运作；<br />
                （2）帮助确定用户信用情况；<br />
                （3）设计和推广供用户使用的服务或有关产品；<br />
                （4）确定用户对出借方的负债额；<br />
                （5）经用户许可的其他用途。<br />
                <br />
                第4条用户个人信息的共享<br />
                4.1贝贝贷款平台对用户的信息承担保密义务，不会违反法律规定向第三方出售用户的信息。贝贝贷款平台会在下列情况下将用户的信息与第三方共享：<br />
                （1）事先获得用户的同意或授权；<br />
                （2）根据法律法规的规定或行政或司法机构的要求；<br />
                （3）向贝贝贷款平台的关联方分享用户的个人信息；<br />
                （4）向可信赖的合作伙伴提供用户的个人信息，让他们根据贝贝贷款平台的指示并遵循贝贝贷款平台的政策以及其他任何相应的保密和安全措施来为贝贝贷款平台处理这些信息；<br />
                （5）如用户出现违反中国有关法律、法规或者贝贝贷款平台相关协议或相关规则的情况，需要向包括但不限于权利人（包括贝贝贷款平台）、行政、司法机关等第三方披露或使用等（包括进行公证、见证等证据保全）；<br />
                （6）如用户是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；<br />
                （7）只有共享用户的信息，才能提供用户需要的服务；<br />
                （8）在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受此隐私权政策的约束，否则我们会要求该公司、组织重新向您征求授权同意；<br />
                （9）为维护贝贝贷款平台及其关联方或用户的合法权益。<br />
                4.2 但无论如何，贝贝贷款平台不会将您的个人信息用户非法目的，也不会向任何用于非法目的的第三方分享您的个人信息。<br />
                <br />
                第5条自动收集工具的使用<br />
                5.1为使用户获得更轻松的访问体验，用户访问贝贝贷款平台相关网站或使用贝贝贷款平台提供的服务时，贝贝贷款平台可能会通过小型数据文件识别用户的身份，这么做是帮用户省去重复输入注册信息的步骤，或者帮助判断用户的账户安全。这些数据文件可能是Cookie，Flash Cookie，或用户的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。<br />
                5.2请用户理解，贝贝贷款平台的某些服务只能通过使用“Cookie”才可得到实现。如果用户的浏览器或浏览器附加服务允许，用户可以修改对Cookie的接受程度或者拒绝贝贝贷款平台的Cookie，但这一举动在某些情况下可能会影响用户安全访问贝贝贷款平台相关网站和使用贝贝贷款平台提供的服务。<br />
                5.3网页上常会包含一些电子图象（称为"单像素" GIF 文件或 "网络 Beacon"），使用网络Beacon可以帮助网站计算浏览网页的用户或访问某些Cookie，贝贝贷款平台会通过网络Beacon收集用户浏览网页活动的信息，例如用户访问的页面地址、用户先前访问的援引页面的位址、用户停留在页面的时间、用户的浏览环境以及显示设定等。<br />
                <br />
                第6条用户个人信息的存储<br />
                6.1 为了提高服务效率及质量，贝贝贷款平台会缓存您的贷款、还款记录，并用于向您提供贷款、还款信息查询服务。<br />
                6.2 您的个人信息储存于中华人民共和国境内。除非获得您的特别同意，或者满足法律规定的评估及许可程序，我们不会跨境转移您的个人信息。<br />
                6.3 除非法律法规另有规定，我们将按如下期间保存您的信息：<br />
                (1)您使用我们的平台服务期间，我们将根据业务需要持续为您保存或删除个人信息，除非您自主删除这些信息或者注销账户；<br />
                (2)当您删除个人信息或注销账户后，我们有权按照法律规定的要求继续保存或删除您的信息。<br />
                <br />
                第7条用户个人信息的保护<br />
                7.1为保障用户的信息安全，贝贝贷款平台努力采取各种合理的物理、电子和管理方面的安全措施来保护用户的信息，使用户的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。贝贝贷款平台对可能接触到用户的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。贝贝贷款平台会按现有技术提供相应的安全措施来保护用户的信息，提供合理的安全保障，贝贝贷款平台将尽力做到使用户的信息不被泄漏、毁损或丢失。<br />
                7.2用户的账户均有安全保护功能，请妥善保管用户的账户及密码信息。贝贝贷款平台将通过向其它服务器备份、对用户密码进行加密等安全措施最大程度确保用户的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请用户理解在信息网络上不存在“完善的安全措施”。贝贝贷款平台无法承诺用户数据及信息的完全安全。<br />
                7.3在使用贝贝贷款平台服务进行网上交易时，用户不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请用户妥善保护自己的个人信息，仅在必要的情形下向他人提供。如用户发现自己的个人信息泄密，尤其是账户及密码发生泄露，请用户立即联络贝贝贷款平台客服，以便贝贝贷款平台采取相应措施。<br />
                <br />
                第8条未成年人保护<br />
                8.1 贝贝贷款平台重视未成年人的个人信息保护，如用户为未成年人，请用户的监护人仔细阅读本政策，并在用户的监护人在场的情况下使用贝贝贷款平台的服务或向贝贝贷款平台提供信息。<br />
                <br />
                第9条您的查询、更正及删除个人信息的权利<br />
                9.1 访问、更正、删除您的个人信息 <br />
                您有权访问、更正、删除您的个人信息，法律法规规定的例外情况除外。您可以通过登录贝贝贷款平台账户自行访问、更正、删除。<br />
                如果您无法通过上述方式访问、更正、删除这些个人信息，您可以随时通过本政策末尾（第11条）公示的联系方式联系我们，我们将在30天内回复您的访问、更正、删除请求。<br />
                9.2 在以下情形中，您可以向我们提出删除个人信息的请求：<br />
                (1)	如果我们处理个人信息的行为违反法律法规；<br />
                (2)	如果我们收集、使用您的个人信息，却未征得您的同意或者超出了与您的约定；<br />
                (3)	如果您不再使用我们的产品或服务，或您注销了账号；<br />
                (4)	如果我们不再为您提供产品或服务。<br />
                当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br />
                9.3 改变您授权同意的范围 <br />
                我们向您提供的产品或者服务，部分功能需要一些基本的个人信息才能得以完成。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。<br />
                您可以随时通过本政策末尾公示的联系方式联系我们，我们将在30天内回复您的改变授权同意或者不想接受我们给您发送的商业广告的请求。当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。<br />
                9.4 注销您的账户 <br />
                您可以随时通过本政策末尾公示的联系方式联系我们，我们将在30天内回复您的注销的请求。<br />
                在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。<br />
                9.5 我们如何响应您的上述请求<br />
                为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。<br />
                对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。<br />
                9.6 在以下情形中，按照法律法规要求，我们将无法响应您的请求：<br />
                (1)	与国家安全、国防安全直接相关的；<br />
                (2)	与公共安全、公共卫生、重大公共利益直接相关的；<br />
                (3)	与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />
                (4)	有充分证据表明您存在主观恶意或滥用权利的；<br />
                (5)	响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。<br />
                (6)	涉及商业秘密的。<br />
                <br />
                第10条免责声明（非常重要）<br />
                10.1 请您理解，由于计算机及互联网技术的飞速发展及同步速度的限制，可能存在或出现各种恶意或非恶意的攻击手段。虽然我们持续致力于提升和加强安全措施，以保护您的个人信息免遭意外或破坏，但仍无法始终保证您的个人信息的百分之百安全。<br />
                10.2 请您理解，您使用产品或服务时所用的系统和通讯网络，或硬件设备等我们均无法控制，请您了解并注意保护您的个人信息安全。<br />
                10.3 请您注意，我们的网站、产品、应用软件和服务中可能含有第三方网站、产品和服务的链接。第三方收集的可能涉及您的个人信息，须遵守第三方关于个人信息的规定。我们希望您能了解这些第三方的隐私政策。我们会尽商业上的合理努力去要求这些第三方主体对您的个人信息采取保护措施，但我们无法保证这些主体一定会按照我们的要求采取保护措施，亦不对这些主体的行为及后果承担任何责任。如果您发现这些第三方创建的网页或第三方开发的应用程序存在风险时，建议您终止相关操作以保护您的合法权益。<br />
                10.4 例如所有的企业都可能面临的问题一样，考虑到信息技术、网络空间本身的特点，在某些特殊情况下（例如黑客攻击、电信故障等），尽管我们采取了法律、法规等规定的必要的措施，但仍然存在个人信息泄露的风险。除非本隐私政策有其他规定，为了保护您的人身及财产安全，我们特别提醒您不要通过公共网络，向我们或任何以我们名义为您提供服务的第三方，提供您的账户密码、验证码、通信内容等信息。<br />
                <br />
                第11条 您如何联系贝贝贷款平台<br />
                <br />
                11.1 如您对本隐私政策的内容，或对我们如何处理您的个人信息，有任何疑问、意见、建议、担忧、投诉或举报，请按照如下方式联系我们：<br />
               
                联系邮箱：beibeidaikuan@chelun.com<br />
                我们会在30日内响应您的请求，并依据本隐私政策及法律法规处理您的请求。<br />
                11.2 在经与我们沟通后，如您对我们的答复不满意，您可以联系负责个人信息保护相关投诉的有关行业协会、监管部门，或者依据中华人民共和国的法律向上海市浦东新区人民法院提起诉讼。<br />

            </div>
        )
    }
}