import React, { Component } from 'react'
import './protocol.scss'
import { _setTitle } from '../../helper/helper'

export default class ServiceProtocol extends Component {
    componentDidMount(){
        _setTitle("贝贝贷款平台用户服务协议")
    }

    render() {
        return (
            <div className="protocol">
                感谢您成为贝贝贷款平台的用户。<br />
                <br />
                《贝贝贷款平台用户服务协议》（以下简称“本协议”）是由用户与贝贝贷款平台就使用贝贝贷款平台的用户服务等相关事宜共同缔结，本协议内容包括《贝贝贷款平台用户注册协议》及《贝贝贷款隐私政策》两部分内容。<br />
                <br />
                用户在贝贝贷款平台注册，即表示您已审慎阅读、充分理解并接受本协议及贝贝贷款平台所有条件和条款，特别是以黑体加粗形式提示用户注意的条款。用户部分或全部不接受上述协议及政策内容的，不得使用贝贝贷款平台服务。<br />
                <br />
                本协议是正式的、完整的协议。本协议内容同时包括贝贝贷款平台可能不断发布或更新的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分。<br />
                <br />
                贝贝贷款平台所提供的各项服务的所有权和运营权，均归属于上海车轮互联网服务有限公司及其关联公司。<br />
                <br />
                请您在使用前查看完整的《贝贝贷款平台用户注册协议》及《贝贝贷款隐私政策》<br />
                <br />
                贝贝贷款平台用户注册协议<br />
                <br />
                协议版本：2018年08月版<br />
                <br />
                第1条 平台及用户定义<br />
                <br />
                1.1 贝贝贷款平台，指包括相关移动应用（包括但不限于“贝贝贷款”等移动应用程序）、自媒体平台（包括但不限于微信、微博）账号及小程序的合称，是为用户提供贷款信息服务的互联网平台。<br />
                <br />
                1.2 用户，是指使用平台服务的自然人用户可以通过贝贝贷款平台获取相应的信息服务。除贝贝贷款平台明示作为服务提供者向用户提供具体服务外，贝贝贷款平台不直接参与用户与出借方之间的交易，双方因交易发生争议的，应当根据合同相对性原则自行协商处理或寻求贝贝贷款平台居间处理争议。<br />
                <br />
                1.3 服务，系指服务提供者向有需求贷款、借款的用户提供贷款服务信息及其他相关服务。<br />
                <br />
                第2条 本协议的签署与修订<br />
                <br />
                2.1 用户应在使用平台服务之前认真阅读本协议及相关业务规则内容。如对协议有任何疑问的，应向贝贝贷款平台客服咨询。但无论用户事实上是否在使用平台服务之前认真阅读了本协议内容，只要用户使用平台服务，则本协议即对用户产生约束，届时用户不应以未阅读本协议的内容或者未获得贝贝贷款平台客服对问询的解答等理由，主张本协议无效，或要求撤销本协议。<br />
                <br />
                2.2 用户必须完全同意所有服务条款并完成注册程序，才能成为贝贝贷款平台的注册用户。在用户按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后，或以贝贝贷款平台允许的其他方式实际使用平台服务时，用户即受本协议的约束。<br />
                <br />
                2.3 用户须确认，在完成注册程序或以贝贝贷款平台允许的其他方式实际使用平台服务时，应当是具备完全民事行为能力和责任能力的自然人。如果不具备前述主体资格，贝贝贷款平台有权中止或注销该用户的账户。<br />
                <br />
                2.4 用户应当保证注册时提供的信息、资料的完整性、真实性、合法性。贝贝贷款平台有权根据业务需要，不时审核用户的注册信息及提供的资料是否完整真实有效，一旦发现用户信息和资料不符合贝贝贷款平台业务规则的，贝贝贷款平台有权中止或注销该用户。<br />
                <br />
                2.5 用户承诺有条件、有资格使用贝贝贷款平台提供的服务。用户应当具备法律、法规等规定的、及贝贝贷款平台要求的从事相关交易必要的资格及条件。<br />
                <br />
                2.6 根据业务需要，贝贝贷款平台保留在国家法律允许的范围内，独自决定拒绝服务、中止服务、终止服务或注销用户账户的权利。<br />
                <br />
                2.7 根据国家法律法规变化及网站运营需要，贝贝贷款平台有权对本协议条款不时进行修改，修改后的协议一经发布后即刻生效，与原协议冲突部分以修改后的协议为准。用户可在贝贝贷款平台随时查阅最新协议。用户若不同意更新后的协议，可以且应立即停止接受贝贝贷款平台依据本协议提供的服务；如用户继续使用贝贝贷款提供的服务的，即视为同意更新后的协议。<br />
                <br />
                2.8 用户在使用贝贝贷款平台某些特定服务时，贝贝贷款平台可能会就特定的服务与用户订立单独的协议或提供相关的业务规则等（以下统称为“单独协议”），用户在使用该特定服务前应阅读并同意相关的单独协议，用户若不同意上述单独协议，可以且应立即停止接受贝贝贷款平台依据单独协议提供的特定服务；如用户继续使用贝贝贷款提供的特定服务的，即视为同意单独协议。<br />
                <br />
                2.9 本协议包括协议正文及所有贝贝贷款平台已经发布的，或未来可能发布或更新的各类规则。所有规则及政策为本协议不可分割的组成部分，与本协议正文具有同等法律效力。<br />
                <br />
                3.0 用户通过第三方平台或其他合法渠道使用平台服务的，除非书面合同有相反的约定，应当遵守本协议。<br />
                <br />
                第3条 平台服务提供<br />
                <br />
                3.1 贝贝贷款平台可能为不同的终端设备开发了不同的网站或应用程序版本，用户应当根据实际情况选择登录、下载合适的版本使用。贝贝贷款平台不保证所有的版本与相关设备的适配性和可用性，亦不保证所有的版本提供的平台服务的一致性。<br />
                <br />
                3.2 贝贝贷款平台提供的平台服务为：向有贷款需求的用户提供贷款服务信息及其他相关服务。具体以贝贝贷款平台届时有效的服务内容为准。<br />
                <br />
                3.3 尽管贝贝贷款平台尽力保证平台服务的有效性和可用性，但因电信故障、黑客攻击或政策变动等因素，可能导致平台服务部分或全部无效或调整，用户理解并接受该等情形的出现，并放弃因此向贝贝贷款平台索赔的权利。<br />
                <br />
                3.4 用户必须自行准备如下服务设备，并承担相关服务开支：<br />
                （1）服务设备，包括并不限于手机、电脑或者其他移动终端、调制解调器及其他必备的上网装置。<br />
                （2）服务开支，包括并不限于网络接入费、上网设备租用费、网络带宽或流量费、信息服务费，以及获取专业服务过程可能发生的其他费用等。<br />
                <br />
                3.5 用户使用贝贝贷款平台服务而需要下载相关客户端程序时，贝贝贷款平台给予用户一项单个的、不可转让及非排他性的许可。用户仅在使用贝贝贷款平台服务时使用相关客户端程序，不进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现相关客户端程序的源代码；不得删除相关客户端程序及其副本上关于著作权的信息。用户终止使用贝贝贷款平台服务时，应当立即删除相关客户端程序及其数据。<br />
                <br />
                3.6 本条及本协议其他条款未明示授权的其他一切权利仍由贝贝贷款平台保留，用户在行使这些权利时须另外取得贝贝贷款平台的书面许可。贝贝贷款平台如果未行使前述任何权利，并不构成对该权利的放弃。<br />
                <br />
                3.7 用户承诺，用户使用贝贝贷款平台服务的，不构成对任何法律、协议及其他法律文件违反。<br />
                <br />
                第4条 账户管理<br />
                <br />
                4.1 用户使用贝贝贷款平台的服务，需要通过手机号码进行实名制注册，用户注册成功后，贝贝贷款平台会为用户开通一个账户，作为用户使用贝贝贷款平台服务的唯一身份标识。该账户及该账户产生的所有数据及信息的所有权均归属于贝贝贷款平台，用户在贝贝贷款平台使用贝贝贷款平台服务期间拥有使用权。<br />
                <br />
                4.2 若使用第三方网站账号（如淘宝等）注册贝贝贷款平台用户账户，则用户应对用户账户所对应的第三方网站账号拥有合法的使用权。如用户因故对该第三方网站账号丧失使用权的，则贝贝贷款平台可停止为用户账户提供服务。<br />
                <br />
                4.3 用户注册成功后，用户应谨慎合理的保存、使用其用户名和密码，并对利用用户的用户名和密码完成管理权限验证而实施的所有行为、活动及事件负全责。用户若发现任何不当使用用户账号或存在安全漏洞等其他可能危及用户账户安全的情况，应当立即以有效方式通知贝贝贷款平台，要求贝贝贷款平台暂停平台服务，并向公安机关报案。<br />
                <br />
                4.4 用户依据4.3条发出的通知至少应当包括情况描述，相关的初步证据，要求贝贝贷款平台处理的具体措施，通知人联系信息等，缺乏前述信息的通知视为无效通知。用户理解贝贝贷款平台对用户的通知请求识别、采取行动需要合理时间，贝贝贷款平台对在采取行动前已经产生的后果（包括但不限于用户的任何损失）不承担任何责任。<br />
                <br />
                4.5 用户可以为用户账户设定昵称，但该昵称不得侵犯他人合法权益。如贝贝贷款平台认为用户设定的昵称涉嫌侵犯他人合法权益的，贝贝贷款平台有权终止为用户提供服务，并注销用户的昵称。<br />
                <br />
                4.6 用户注册帐号后如果长期不登录该帐号，贝贝贷款平台有权回收、注销该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。<br />
                <br />
                4.7 用户理解并同意，贝贝贷款平台通过向用户注册时预留的地址、电话、邮箱等任一方式发送信息，或者通过贝贝贷款平台发送站内信息，即视为贝贝贷款平台向用户履行了送达、通知义务。<br />
                <br />
                4.8 鉴于网络服务的特殊性，贝贝贷款平台有权利但无义务审核是否是用户本人登陆、使用该账户。用户不得将账户借/租给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。一经发现，贝贝贷款平台有权注销此账户。同时，贝贝贷款平台将不承担因此而产生的任何责任。<br />
                <br />
                4.9 用户向贝贝贷款平台提出注销账户申请，经贝贝贷款平台审核同意后，由贝贝贷款平台注销用户账户，本协议即告终止。<br />
                <br />
                4.10 在下列情况下，贝贝贷款平台可以单方解除本协议并注销用户账户：<br />
                （1）用户违反本协议相关规定的；<br />
                （2）用户注册信息中的内容是虚假的；<br />
                （3）用户不愿接受新公布或修订的协议的；<br />
                （4）贝贝贷款平台认为需终止提供服务的其他情况。<br />
                贝贝贷款平台依据本条款单方解除本协议后，如该用户再一次直接或间接或以他人名义注册为贝贝贷款平台用户的，贝贝贷款平台有权暂停或终止向该用户提供服务。<br />
                <br />
                4.11 用户理解并同意，通过任何形式或方式，用户账户注销后、或者本协议终止后，贝贝贷款平台有权：<br />
                （1）在法律法规允许的前提下，继续保存并使用用户的信息；<br />
                （2）继续向用户主张在其使用贝贝贷款平台交易平台服务期间因违反法律法规、本协议及平台规则而应承担的责任；<br />
                （3）将已注销用户账户昵称开放给任意注册用户。<br />
                <br />
                第5条 用户权利义务<br />
                <br />
                5.1 用户有权根据协议的约定，在贝贝贷款平台的注册账号头像、名字、用户说明等注册信息，或文字、语音、图片等发送、回复和相关链接页面，以及其他使用贝贝贷款帐号或本应用及服务所产生的内容。<br />
                <br />
                5.2 用户保证在使用贝贝贷款平台服务过程中遵守法律法规、不违背社会公德及遵守诚实信用原则，不扰乱贝贝贷款平台交易的正常秩序，不损害他人的合法权益，不违反本协议及相关规则。如果违反前述承诺，产生任何法律后果的，用户应以自己的名义独立承担所有的法律责任，并确保贝贝贷款平台免于因此产生任何损失。因此用户将不会实施以下任一行为：<br />
                （1）以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等非贝贝贷款平台认可的方式访问或登录贝贝贷款平台；<br />
                （2）侵入贝贝贷款平台或国家计算机信息系统；<br />
                （3）通过任何方式对贝贝贷款平台造成或可能造成不合理或不合比例的重大负荷；<br />
                （4）通过发送病毒、木马等行为攻击其它用户的账号或终端设备；<br />
                （5）利用贝贝贷款平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；<br />
                （6）冒充贝贝贷款平台工作人员欺骗其他用户；<br />
                （7）用户之间私自达成线下交易，或者通过线下方式支付商品费用；<br />
                （8）下单后无正当理由拒不收货；<br />
                （9）通过留言、评价等手段发送违规或垃圾信息；<br />
                （10）协助、教唆他人从事本协议所禁止的行为；<br />
                （11）贝贝贷款平台其他规则规定的不当行为。<br />
                <br />
                5.3 用户理解并保证不在贝贝贷款平台发布或转载包含以下内容的言论：<br />
                （1）反对宪法所确定的基本原则，煽动、抗拒、破坏宪法和法律、行政法规实施的；<br />
                （2）煽动颠覆国家政权，推翻社会主义制度，煽动、分裂国家，破坏国家统一的；<br />
                （3）损害国家机关信誉的、损害国家荣誉和利益的、损害社会公共利益和涉及国家安全的；<br />
                （4）煽动民族仇恨、民族歧视，破坏民族团结的；<br />
                （5）任何包含对种族、性别、宗教、地域内容等歧视的；<br />
                （6）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；<br />
                （7）宣扬封建迷信、邪教、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；<br />
                （8）骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的、公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；<br />
                （9）其他违反宪法和法律行政法规的。<br />
                <br />
                5.4 用户在发表使用体验、讨论或图片、或进行社区交互时，除遵守本条款外，还应遵守贝贝贷款平台的其他相关规定。<br />
                <br />
                5.5 未经贝贝贷款平台同意，禁止用户在贝贝贷款平台上发布任何形式的广告。<br />
                <br />
                5.6 除另有约定外，用户理解并保证不利用贝贝贷款平台进行经营活动、牟利行为及其他未经贝贝贷款平台许可的行为，包括但不仅限于以下行为：<br />
                （1）转卖贝贝贷款平台账户、积分、返利、抵用券或其他类型的优惠券、礼品卡、或利用贝贝贷款平台账户进行其他经营性行为等；<br />
                （2）恶意利用技术手段或其他方式，为获取优惠、折扣或其他利益而注册多个账户、下单等行为，影响其他用户正常消费行为或相关合法权益、影响贝贝贷款平台正常销售秩序的行为；<br />
                （3）以再销售或商业使用为目的，对贝贝贷款平台商品或服务进行购买的（与贝贝贷款平台另有合同约定的除外）；<br />
                （4）商品或服务的供应商、代理商对其所供商品进行回购的行为；<br />
                （5）任何对文字、图片、音频、视频形式的商品目录、说明、价格、数量、其他用户信息或其他内容的下载、转载、收集、衍生利用、复制、出售、转售或其他形式的获取或使用，无论是否通过Robots、Spiders、自动仪器或手工操作；<br />
                （6）贝贝贷款平台相关规则、政策、网页、活动规则中限制、禁止的行为；<br />
                （7）其他影响贝贝贷款平台对用户账户正常管理秩序的行为。<br />
                <br />
                5.7 用户不得利用任何非法手段获取其他用户个人信息，不得将其他用户信息用于任何营利或非营利目的，不得泄露其他用户或权利人的个人隐私，否则贝贝贷款平台有权采取措施制止用户的上述行为，情节严重的，将提交相关监管部门处理。<br />
                <br />
                5.8 用户不得发布任何侵犯他人著作权、商标权等知识产权或其他合法权利的内容；如果有其他用户或权利人发现用户发布的信息涉嫌知识产权、或其他合法权益争议的，这些用户或权利人要求贝贝贷款平台删除用户发布的信息，或者采取其他必要措施予以制止的，贝贝贷款平台将会依法采取这些措施，具体规则参见贝贝贷款平台《免责声明》<br />
                <br />
                5.9 若用户未遵守以上规定的，贝贝贷款平台有权依据本协议的约定，做出相应处理或终止提供服务，且无须征得用户的同意或提前通知用户。<br />
                <br />
                5.10 对于用户在贝贝贷款平台上实施的行为，包括未在贝贝贷款平台上实施但已经对贝贝贷款平台及其用户产生影响的行为，贝贝贷款平台有权单方认定该行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的必要的处理措施。<br />
                <br />
                5.11 对于用户涉嫌违反承诺的行为对任意第三方造成损害的，用户均应当以自己的名义独立承担所有的法律责任，并应确保贝贝贷款平台免于承担因此产生的损失或增加的费用。<br />
                <br />
                5.12 如用户涉嫌违反有关法律或者本协议之规定，使贝贝贷款平台遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，用户应当赔偿贝贝贷款平台因此造成的损失及发生的费用，包括合理的律师费用。<br />
                <br />
                第6条 贝贝贷款平台的权利和义务<br />
                <br />
                6.1 用户确认其知悉，对于贝贝贷款平台提供的信息内容涉及根据法律法规或规范性文件需要数据查询或使用者获得数据相关方权利人授权的，用户及用户相关系统使用人员应当于数据查询与使用前自行获取相关权利人授权，尚未获得相关权利人授权而对相关信息进行查询与使用的，因此造成一切不利后果由用户自行承担。<br />
                <br />
                6.2 用户在使用本应用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。应用服务提供者和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。<br />
                <br />
                6.3 因用户使用本应用或要求应用服务提供者提供特定服务时，本应用可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供（包括但不限于第三方通过贝贝贷款公众账号提供的服务，或通过开放平台接入的内容等），应用服务提供者不保证通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与应用服务提供者无关，应用服务提供者不承担任何责任。<br />
                <br />
                第7条 个人信息保护与隐私政策<br />
                <br />
                具体参见《贝贝贷款平台隐私政策》。<br />
                <br />
                第8条 知识产权保护<br />
                <br />
                8.1 除非有相反证据证明外，贝贝贷款平台上的所有图标、标识、网页页眉、按钮图标、服务名称、文字、图片音频、视频等的知识产权及所有权均归属于贝贝贷款平台。未经贝贝贷款平台书面许可，任何人不得自行或提供第三方使用。<br />
                <br />
                8.2 用户在贝贝贷款平台发布的文字、图片、音频、视频形式的作品所有权及著作权归用户所有。用户特在此授予贝贝贷款平台一个无偿、永久的独家使用权，并有权对该使用权进行再授权，以使贝贝贷款平台有权在全球范围内全部或部分地使用、复制、改编、发布、翻译和展示用户登记或发布在贝贝贷款平台上的各类作品及信息，或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入贝贝贷款平台其他作品内。<br />
                <br />
                8.3 用户认为贝贝贷款平台内容可能涉嫌侵犯自身合法权益的，可以通过贝贝贷款平台提出书面通知，贝贝贷款平台收到后将及时处理。若用户认为被通知行为未侵权他人合法权益的，可向贝贝贷款平台作出书面的反通知，贝贝贷款平台收到后将及时处理。<br />
                <br />
                第9条 其他<br />
                <br />
                9.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国的法律。如就本协议内容或其执行发生任何争议，则双方应首先通过友好协商方式解决；协商不成的，任何一方均应向上海市浦东新区人民法院提起诉讼。<br />
                <br />
                9.2 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。<br />
                <br />
                9.3 如本协议中的任何条款无论因何种原因被视为完全或部分无效或不具有执行力，该条应视为可分的，且不影响本协议的任何其余条款的有效性、约束力及可执行性。<br />
                <br />
                9.4 本协议中的标题仅为方便而设，不具法律或契约效果。
        </div>
        )
    }
}